app/views/posts/index.html.erb

                  <% else %>
                    <span class="avatar-placeholder"><%= post.account.username.first.upcase %></span>
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = 2 LIMIT 1