app/views/posts/index.html.erb

      <div>
        <%= button_to "❤️ #{post.reactions.count}", like_post_path(post), method: :post, class: "reactions-btn" %>
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
SELECT "reactions".* FROM "reactions" WHERE "reactions"."post_id" IN (3, 1)
SELECT COUNT(*) FROM "reactions" WHERE "reactions"."post_id" = 1

      <div class="comments-wrap">
        <% post.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 3

            <div class="comment-actions">
              <%= button_to "👍 #{comment.comment_reactions.count}",
                            like_post_comment_path(post, comment),
                            method: :post,
                            class: "", title: "Like comment" %>
---
SELECT COUNT(*) FROM "comment_reactions" WHERE "comment_reactions"."comment_id" = 5