app/controllers/accounts_controller.rb

INSERT INTO "accounts" ("status", "created_at", "updated_at", "username", "email", "password_digest", "display_name", "bio") VALUES ('active', '2026-01-27 14:58:29.257463', '2026-01-27 14:58:29.257463', 'aesrdtfyghjkkjjkhkhj', 'szkjjkdxfcghv@gmail.com', '$2a$12$ZQ1mGsp7C0E7DJz9ioqGfe359FocRLxOmQypyLMyH7qRZe0UoE1JS', NULL, NULL) RETURNING "id"
---
  def create
    @account = Account.new(account_params)
    if @account.save