app/controllers/application_controller.rb

SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = 3 LIMIT 1
---
  def current_account
    # Find the account by ID from the session if present
    # @current_account ||= — a built-in pattern to avoid querying the DB twice (memoization)
    @current_account ||= Account.find_by(id: session[:account_id]) if session[:account_id]