app/controllers/comments_controller.rb

  def like
    @comment = Comment.find(params[:id])
    # Check whether there is already a like from this account
    @reaction = @comment.comment_reactions.find_by(account: current_account)

    if @reaction
      @reaction.destroy # If present — remove (unlike)
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = 5 LIMIT 1
SELECT "comment_reactions".* FROM "comment_reactions" WHERE "comment_reactions"."comment_id" = 5 AND "comment_reactions"."account_id" = 3 LIMIT 1
DELETE FROM "comment_reactions" WHERE "comment_reactions"."id" = 12