app/controllers/posts_controller.rb

  def my_profile
    # Find posts only for the current account and optionally show saved posts
    @account = current_account
    @tab = params[:tab].presence_in(%w[posts saved liked]) || 'posts'
    @posts = current_account.posts.order(created_at: :desc)
    @saved_posts = current_account.saved.order(created_at: :desc)
    @liked_posts = current_account.reactions.includes(:post).map(&:post).sort_by(&:created_at).reverse
---
SELECT COUNT(*) FROM "reactions" WHERE "reactions"."post_id" = 3