app/controllers/sessions_controller.rb

SELECT "accounts".* FROM "accounts" WHERE "accounts"."email" = 'vovasmirnon5895@gmail.com' LIMIT 1
---
  def create
    account = Account.find_by(email: params[:email])